Repository: flammie/purplemonkeydishwasher
Catalog: 2016-iwclul/en-et (1).tmx
Source language: en
Languages: et

source: Clear the file system queue when quitting
et: Puhasta failisüsteemi järjekord väljumisel

source: Duplicate Albums
et: Albumi duplikaadid

source: Displayed are albums that should likely be merged. For each row, click the desired title to make it bold, or uncheck it to take no action.
et: Kuvatakse albumid, mis peaksid olema ühendatud. Iga rea jaoks klõpsa soovitud zanril , et muuta see 'rasvaseks' või ära märgi seda, et ei tehtaks midagi.

source: Duplicate Artists
et: Esitaja duplikaadid

source: Displayed are artists that should likely be merged. For each row, click the desired name to make it bold, or uncheck it to take no action.
et: Kuvatakse artistid, mis peaksid olema ühendatud. Iga rea jaoks klõpsa soovitud zanril , et muuta see 'rasvaseks' või ära märgi seda, et ei tehtaks midagi.

source: Fix Music Metadata...
et: Paranda muusika metaandmed...

source: Metadata Fixer
et: Metateabe parandaja

source: Problem Type:
et: Probleemi tüüp:

source: Apply Selected Fixes
et: Rakenda märgitud parandused

source: Duplicate Genres
et: Žanri duplikaadid

source: Displayed are genres that should likely be merged. For each row, click the desired genre to make it bold, or uncheck it to take no action.
et: Kuvatakse zanrid, mis peaksid olema ühendatud. Iga rea jaoks klõpsa soovitud zanril , et muuta see 'rasvaseks' või ära märgi seda, et ei tehtaks midagi.

source: and
et: ja

source: a_BAR_an_BAR_the
et: , The

source: Fix?
et: Kas parandada?

source: Open Webpage
et: Veebilehe avamine

source: Visit Archive.org
et: Külasta Archive.org lehte

source: Subscribe
et: Telli

source: Internet Archive: {0}
et: Interneti arhiiv: {0}

source: Try Again
et: Proovi uuesti

source: Error getting item details from the Internet Archive
et: Andmete hankimisel internetist ilmnes tõrge

source: Creator:
et: Autor:

source: Venue:
et: Toimumispaik:

source: Location:
et: Asukoht:

source: Date:
et: Kuupäev:

source: Year:
et: Aasta:

source: Publisher:
et: Avaldaja:

source: Keywords:
et: Võtmesõnad:

source: License URL:
et: Litsentsi URL:

source: Language:
et: Keel:

source: Downloads, overall:
et: Allalaadimisi kokku:

source: Downloads, past month:
et: Allalaadisi möödunud kuul:

source: Downloads, past week:
et: Allalaadisi möödunud nädalal:

source: Added:
et: Lisatud:

source: Added by:
et: Lisas:

source: Collections:
et: Kollektsioonid:

source: Contributor:
et: Kaastöötaja:

source: Recorded by:
et: Lindistanud:

source: Lineage:
et: Pärilikkus:

source: Transferred by:
et: Ülekantud:

source: Reviews
et: Ülevaated

source: {0} by {1} on {2}
et: {0} esitajalt {1} plaadilt {2}

source: Write your own review
et: Kirjuta arvustus

source: Collection:
et: Kollektsioon:

source: Optional Query
et: Optiline päring

source: Sort by:
et: Sorteeri:

source: Preferred Media Types
et: Eelistatud meedia liigid

source: _Text
et: _Tekst

source: Search...
et: Otsing...

source: _Go
et: _Mine

source: History
et: Ajalugu

source: Classic Cartoons
et: Klassikalised multifilmid

source: Speeches
et: Kõned

source: For Children
et: Lastele

source: Poetry
et: Poeesia

source: Creator is United States
et: Looja on USA

source: Old Movies
et: Vanad filmid

source: New From LibriVox
et: Uued LibriVoxilt

source: Old Texts
et: Vanad tekstid

source: Visit the Internet Archive online at archive.org
et: Külasta interneti arhiivi internetist archive.org lehelt

source: Movies
et: Filmid

source: Lectures
et: Loengud

source: Concerts
et: Kontserdid

source: Books
et: Raamatud

source: Search Results
et: Otsingutulemused

source: Searching the Internet Archive
et: Interneti arhiivi otsimine

source: No matches.
et: Vasted puuduvad

source: Error searching the Internet Archive
et: Interneti arhiivi otsimisel ilmnes tõrge

source: Fetch more results from the Internet Archive?
et: Hangita rohkem tulemusi interneti arhiivist?

source: Fetch More
et: Hangi juurde

source: Creator
et: Looja

source: Publisher
et: Avaldaja

source: Formats
et: Vormingud

source: Added
et: Lisatud

source: Collection
et: Kogumik

source: Contributor
et: Kaastööline

source: Created
et: Loodud

source: Format
et: Vorming

source: Language
et: Keel

source: Media Type
et: Meedia liik

source: Moving Images
et: Liikuvad pildid

source: Animation & Cartoons
et: Multikad ja animatsioonid

source: Arts & Music
et: Kunst ja muusika

source: Computers & Technology
et: Arvutid ja tehnoloogia

source: Cultural & Academic Films
et: Kultuur ja akadeemiline

source: Ephemeral Films
et: Lühikesed filmid

source: Home Movies
et: Koduvideod

source: News & Public Affairs
et: Uudised ja avalikkus

source: Open Source Movies
et: Avatud lähtekoodiga filmid

source: Prelinger Archives
et: Prelingeri arhiivid

source: Spirituality & Religion
et: Vaimulik

source: Sports Videos
et: Spordivideod

source: Videogame Videos
et: Mänguvideod

source: Vlogs
et: Videologid

source: Youth Media
et: Noortemeedia

source: Texts
et: Tekstid

source: American Libraries
et: Ameerika raamatukogud

source: Canadian Libraries
et: Kanada raamatukogud

source: Universal Library
et: Üldkogumik

source: Project Gutenberg
et: Gutenbergi projekt

source: Children's Library
et: Laste kogumik

source: Biodiversity Heritage Library
et: Elumitmekesisuse päranduse raamatukogu

source: Additional Collections
et: Lisakogud

source: Audio Books & Poetry
et: Audioraamatud ja poeesia

source: Grateful Dead
et: Tänulik surm

source: Live Music Archive
et: Live muusika arhiiv

source: Music & Arts
et: Muusika ja kunstid

source: Non-English Audio
et: Mitte.ingliskeelne audio

source: Open Source Audio
et: Avatud lähtekoodiga muusika

source: Radio Programs
et: Raadioprogrammid

source: Education
et: Haridus

source: Software
et: Tarkvara

source: Downloads This Week
et: Selle nädala allalaadimised

source: Newest
et: Uusimad

source: Oldest
et: Vanimad

source: Radio
et: Raadio

source: Add Station
et: Lisa jaam

source: Add a new Internet Radio station or playlist
et: Lisa uus interneti raadiojaam või lugude nimekiri

source: Search your stations
et: Sinu jaamade otsimine

source: Edit Station
et: Redigeeri jaama

source: Station
et: Jaam

source: Please provide a valid station URI
et: Palun sisesta kehtiv jaama URL

source: Please provide a station genre
et: Palun sisesta jaamale zanr

source: Please provide a station title
et: Palun sisesta jaamale nimi

source: Add new radio station
et: Lisa uus raadiojaam

source: Edit radio station
et: Muuda raadiojaama

source: Enter the Genre, Title and URL of the radio station you wish to add. A description is optional.
et: Sisesta raadiojaama zanr, pealkiri ja URL, mida soovid lisada. Kirjeldus pole kohustuslik.

source: Station Genre:
et: Jaama zanr

source: Station Name:
et: Jaama nimi:

source: Stream URL:
et: Voo URL:

source: Station Creator:
et: Raadiojaama looja:

source: Description:
et: Kirjeldus:

source: Rating:
et: Hinnang:

source: Configure the Audioscrobbler plugin
et: Seadista Audioscrobbler pluginat

source: Visit _User Profile Page
et: Külasta _kasutajaprofiili

source: Visit Your Last.fm Profile Page
et: Külasta Last.fm profiili

source: Connect
et: Ühendu

source: View on Last.fm
et: Vaata Last.fm-is

source: View this artist's Last.fm page
et: Vaata selle artisti Last.fm lehte

source: View Artist on Wikipedia
et: Vaata artistist Vikipeedias

source: Find this artist on Wikipedia
et: Leia see artist Vikipeedias

source: View Artist's Videos
et: Vaata artisti videosid

source: Find videos by this artist
et: Leia selle artisti videosid

source: Recommend to
et: Soovitatud

source: Recommend this artist to someone
et: Soovita seda artisti kellegile

source: View this album's Last.fm page
et: Vaata selle albumi Last.fm lehte

source: Recommend this album to someone
et: Soovita seda albumit kellegile

source: View this track's Last.fm page
et: Vaata selle loo Last.fm lehte

source: Recommend this track to someone
et: Soovita seda lugu kellegile

source: http://en.wikipedia.org/wiki/{0}
et: http://et.wikipedia.org/wiki/{0}

source: Account
et: Konto

source: _Username
et: _Kasutajanimi

source: Sign up for Last.fm
et: Loo Last.fm konto

source: Open Last.fm in a browser, giving you the option to authorize Banshee to work with your account
et: Ava Last.fm veebibrauseris, et anda Bansheele volitused sinu kontoga töötamiseks

source: Log in to Last.fm
et: Logi Last.fm raadiojaama sisse

source: You need to allow Banshee to access your Last.fm account.
et: Sa pead lubama Bansheel ligipääsu sinu Last.fm kontosse.

source: Finish Logging In
et: Lõpeta sisselogimine

source: You are logged in to Last.fm as the user {0}.
et: Oled sisse loginud Last.fm raadiojaama kontoga {0}.

source: Log out of Last.fm
et: Logi välja serverist Last.fm.

source: Recently Loved Tracks
et: Viimati meeldinud

source: Recently Played Tracks
et: Viimati kuulatud

source: My Top Artists
et: Minu top artistid

source: {0} plays
et: {0} esitust

source: Account Settings
et: Kontosätted

source: Join Last.fm
et: Ühine Last.fm-iga

source: Last.fm Recommendations
et: Last.fm soovitused

source: Top Albums by {0}
et: Parimad albumid esitajalt {0}

source: Top Tracks by {0}
et: Parimad palad esitajalt {0}

source: Recommended Artists
et: Soovitatud artistid

source: No similar artists found
et: Sarnaseid artiste ei leitud

source: {0}% Similarity
et: {0}% sarnasus

source: Unknown Similarity
et: Tundmatu sarnasus

source: _Add Station...
et: _Lisa raadiojaam...

source: Add a new Last.fm radio station
et: Lisa uus Last.fm raadiojaamFans of" or "Similar to

source: Listen to {0} Station
et: Kuula {0} raadiojaamaFans of" or "Similar to

source: Listen to the Last.fm {0} station for this artist
et: Kuula Last.fm {0} raadiojaama selle artisti jaoks

source: Fans of
et: Neile meeldib

source: Similar to
et: Sarnane

source: Love Track
et: Lugu meeldib

source: Mark current track as loved
et: Märgi üles, et see lugu meeldib

source: Ban Track
et: Keela lugu

source: Mark current track as banned
et: Keela selle loo esitamine

source: Fans of {0}
et: Neile meeldib {0}

source: Similar to {0}
et: Sarnane {0}

source: _Add Station
et: _Lisa raadiojaam

source: Sort Stations by
et: Sordi raadiojaamad:

source: Total Play Count
et: Esitatud lugusid kokku

source: New Station
et: Uus jaam

source: Station _Type:
et: Jaama _tüüp:

source: Last.fm Station
et: Last.fm jaam

source: Edit Last.fm Station
et: Redigeeri Last.fm jaama

source: Delete Last.fm Station
et: Kustuta Last.fm jaam

source: Tuning Last.fm to {0}.
et: Häälestamine Last.fm jaamale {0}.

source: Failed to tune in station. {0}
et: Jaamale häälestamine nurjus. {0}

source: Getting new songs for {0}.
et: {0} uute laulude hankimine.

source: No new songs available for {0}.
et: {0}-s pole uusi laule.

source: Failed to get new songs for {0}.
et: {0} jaoks uute laulude hankimine nurjus.

source: Recommended
et: Soovitatud

source: Personal
et: Isiklik

source: Mix
et: Sega

source: Banshee Group
et: Banshee grupp

source: Neighbors
et: Naabrid

source: For User:
et: Kasutajale:

source: Of User:
et: Kasutajast:

source: Group
et: Grupp

source: Group Name:
et: Grupi nimi:

source: Tag
et: Silt

source: Tag Name:
et: Sildi nimi:

source: Fan
et: Fänn

source: Fans of:
et: Kelle fänn:

source: Similar
et: Sarnane

source: Similar to:
et: Sarnane kellega:

source: Media
et: Meedia

source: Library
et: Kogumik

source: Launch the Banshee Media Player
et: Banshee meediaesitaja käivitamine

source: Now Playing
et: Praegu mängib

source: media
et: meedia

source: Quick access panel for your media
et: Kiirpaneel sinu meediale

source: _Mini Mode
et: _Minirežiim

source: Full Mode
et: Täisrežiim

source: Switch back to full mode
et: Lülitu tagasi täisrežiimi

source: Change repeat playback mode
et: Muuda taasesituse kordusrežiimi

source: Miro Guide
et: Miro juhend

source: Discover interesting podcasts in the Miro Guide podcast directory!
et: Avasta huvitavaid podcaste Miro podcasti juhendikataloog!

source: Open Miro Guide
et: Ava Miro juhend

source: Search for video podcasts
et: Video podcastide otsimine

source: _Close
et: _Sulge

source: _Show Notifications
et: _Näita teateid

source: Show notifications when item changes
et: Näitab teateid, kui esitatav pala muutub

source: Still Running
et: Ikka töötab

source: Banshee was closed to the notification area. Use the Quit option to end your session.
et: Banshee suleti teatealale. Sessiooni lõpetamiseks kasuta Lõpeta.

source: Skip this item
et: Jäta see vahele

source: Cannot show notification
et: Teadet ei saa näidata

source: Simplify
et: Lihtsusta

source: Track {0}
et: Rada {0}

source: Importing Audio CD
et: Audio-CD importimine

source: Initializing Drive
et: Plaadiseadme lähtestamine

source: {0} is still being imported into the music library. Would you like to stop it?
et: {0} importimine muusikakogusse on pooleli. Kas sa tahad selle katkestada?

source: Cannot Import CD
et: Ei sa CD-d importida

source: Audio CDs
et: Audio-CDd

source: Audio CD Importing
et: Audio-CD importimine

source: _Import format
et: _Importimise vorming

source: _Automatically import audio CDs when inserted
et: _Automaatselt impordi sisestatud audioplaadid

source: When an audio CD is inserted, automatically begin importing it if metadata can be found and it is not already in the library.
et: Kui sisestatakse audio-CD, alustatakse automaatselt importimist juhul, kui metateave on leitav ja plaat juba ei ole kogus.

source: _Eject when done importing
et: _Väljasta, kui importimine on valmis

source: When an audio CD has been imported, automatically eject it.
et: Kui audioplaat on imporditud, väljasta see automaatselt.

source: Use error correction when importing
et: Kasuta importimisel veaparandust

source: Error correction tries to work around problem areas on a disc, such as surface scratches, but will slow down importing substantially.
et: Veaparandust püüab üle saada probleemsetest kohtades plaadil nagu kriimud, kuid see aeglustab importimist oluliselt.

source: Import CD
et: Impordi CD

source: Import this audio CD to the library
et: Impordi see audioplaat kogusse

source: Duplicate CD
et: Paljunda CD

source: Duplicate this audio CD
et: Paljunda seda CD-d

source: Searching for track information...
et: Raja andmete otsimine...

source: Could not fetch track information
et: Raja andmeid pole võimalik hankida

source: Could not import CD
et: CD importimine pole võimalik

source: Could not duplicate audio CD
et: Audio CD paljundamine pole võimalik

source: Audio CD Preferences
et: Audio-CD eelistused

source: Eject Disc
et: Väljasta plaat

source: Import ‟{0}”
et: Impordi ‟{0}”Audio CD" or "DVD

source: Ejecting {0}...
et: Audio CD" or "DVD

source: Unable to import track: {0}
et: Rada pole võimalik importida: {0}

source: Importing from Amarok failed
et: Amarokist importimine nurjus

source: iTunes Importer
et: iTunes importija

source: Import song ratings
et: Laulude hinnangute importimine

source: Import play statistics (playcount, etc.)
et: Impordi mängimise statistika (esitusloend, jne)

source: Import playlists
et: Lugude nimekirjade importimine

source: Locate your "{0}" file...
et: Määra "{0}" faili asukoht...

source: Locate "{0}"
et: Leia "{0}" asukoht

source: Locate iTunes Music Directory
et: Määra iTunes muusika kataloogi asukoht

source: iTunes Media Player
et: iTunesi meediaesitaja

source: Banshee is not familiar with this version of the iTunes library format. Importing may or may not work as expected, or at all. Would you like to attempt to import anyway?
et: Banshee ei tunne iTunesi muusikakogu seda versiooni. Importimine ei pruugi toimida ootuspäraselt ning võib üldse mitte toimida. Kas tahad sellest hoolimata proovida importida?

source: Unable to import song.
et: Laulu importimine pole võimalik.

source: _Fill
et: _Täida

source: f_rom
et: _albumilt

source: Add to Play Queue
et: Lisa esitamise järjekorda

source: Append selected songs to the play queue
et: Lisa valitud laulud esitamisjärjekorra lõppu

source: Play After
et: Esita pärast

source: Add selected songs after the currently playing track, album, or artist
et: Lisa valitud

source: Current Track
et: Praegune lugu

source: Current Album
et: Praegune album

source: Current Artist
et: Praegune esitaja

source: Add More
et: Lisa veel

source: Remove all tracks from the play queue
et: Tühjenda esitamise järjekord

source: Clear the play queue when quitting
et: Tühjenda programmi sulgemisel esitamise järjekord

source: Remove From Play Queue
et: Eemalda esitamise järjekorrast

source: Number of _played songs to show
et: Mitut _esitatud laulu näidatakse

source: Number of _upcoming songs to show
et: Mitut _järgmist laulu näidatakse

source: All Podcasts ({0})
et: Kõik Podcastid ({0})

source: Podcasts Folder
et: Podcastide kataloog

source: Remove Podcast
et: Podcasti eemaldamine

source: Disable Auto Updates
et: Keela automaatuuendused

source: Network error updating {0}
et: Võrgu viga {0} uuendamisel

source: Parsing error updating {0}
et: Parsimise viga {0} uuendamisel

source: Authentication error updating {0}
et: Autentimise viga {0} uuendamisel

source: Error updating {0}
et: Viga {0} uuendamisel

source: Search your podcasts
et: Podcastide otsimine

source: Episode Properties
et: Osa omadused

source: Published
et: Avaldatud

source: New
et: Uus

source: Never updated
et: Pole uuendatud

source: Updated at {0}
et: Uuendati täpselt {0}

source: Updated {0}
et: Uuendati {0}

source: New Items
et: Uued kirjed

source: All Items
et: Kõik kirjed

source: Downloading Podcast(s)
et: Podcasti(de) allalaadimine

source: Cancel all podcast downloads?
et: Kas katkestada kõik podcastide allalaadimised?<control><shift>U

source: Add Podcast...
et: Lisa Podcast...

source: Subscribe to a new podcast
et: Telli uus taskuhäälingu saade

source: Unsubscribe and Delete
et: Lõpeta tellimus ja kustuta

source: Check for New Episodes
et: Otsi uusi osi

source: Download All Episodes
et: Laadi kõik osad alla

source: Visit Podcast Homepage
et: Külasta häälingu kodulehte

source: Podcast Properties
et: Podcasti omadused

source: Mark as New
et: Märgi uueks

source: Archive
et: Arhiiv

source: Download
et: Laadi alla

source: Cancel Download
et: Katkesta allalaadimine

source: Visit Website
et: Külasta veebilehte

source: Add Podcast
et: Podcasti lisamine

source: Invalid URL
et: Vigane URL

source: Podcast URL is invalid.
et: Podcast'i URL on vigane.

source: Episode Details
et: Osa üksikasjad

source: Check periodically for new episodes
et: Uusi osi kontrollitakse perioodiliselt

source: If checked, Banshee will check every hour to see if this podcast has new episodes
et: Märgitud olemisel otsib Banshee iga tund selle podcasti uusi episoode

source: Download new episodes
et: Uued osad laaditakse alla

source: Archive all episodes except the newest one
et: Arhiveeri kõik osad peale viimase

source: Name:
et: Nimi:

source: Website:
et: Veebileht:

source: Visit
et: Külasta

source: Subscription Options
et: Tellimise valikud

source: Feed URL:
et: Voo URL:

source: Last Refreshed:
et: Viimati uuendati:

source: Category:
et: Kategooria:

source: Copyright:
et: Autoriõigus:

source: Subscribe to New Podcast
et: Telli uus Podcast

source: Please enter the URL of the podcast to which you would like to subscribe.
et: Sisesta taskuhäälingu, mida tahad tellida, URL aadress.

source: Download all episodes
et: Laaditakse alla kõik osad

source: Download the most recent episode
et: Laaditakse alla kõige uuem osa

source: Let me decide which episodes to download
et: Küsitakse, millised osad alla laadida

source: _Speaker:
et: _Kõneleja:

source: Sample
et: Näidis

source: by '{0}' from '{1}'
et: esitaja '{0}', plaat '{1}'

source: from '{0}'
et: plaadilt '{0}'

source: by '{0}'
et: esitajalt '{0}'

source: _Show Banshee in the sound menu
et: Banshee _näitamine helimenüüs

source: Control Banshee through the sound menu
et: Banshee seadistamine helimenüü abil

source: Show SQL Console
et: Näita SQL konsooli

source: Start SQL Monitoring
et: Käivita SQL jälgimine

source: Stop SQL Monitoring
et: Lõpeta SQL jälgimine

source: Track Preview
et: Raja eelvaade

source: Uploaded by
et: Üleslaetud isikult

source: Play in Banshee...
et: Esita Banshees...

source: Play in Web Browser...
et: Mängi veebibrauseris...

source: No videos found
et: Videoid ei leitud

source: open context menu
et: ava konteksti menüü

source: click
et: klõps

source: Hide {0}
et: Peida {0}

source: Error Details
et: Vea üksikasjad

source: An unhandled exception was thrown:
et: Ilmnes käsitlematu erand:

source: Assembly Version Information
et: Assamblee versiooni teave

source: Assembly Name
et: Assamblee nimi

source: Condition:
et: Seisukord:

source: _Match
et: _Sobita

source: all
et: kõik

source: any
et: vähemalt üks

source: of the following:
et: järgnevatest

source: _Limit to
et: _Piira

source: selected by
et: valitud

source: ago
et: tagasi

source: seconds
et: sekundit

source: days
et: päeva

source: weeks
et: nädalat

source: months
et: kuud

source: years
et: aastat

source: before
et: enne

source: after
et: pärast

source: is
et: on

source: is not
et: ei ole

source: at most
et: ülimalt

source: at least
et: vähemalt

source: less than
et: vähem kui

source: more than
et: rohkem kui

source: {0} ago
et: {0} tagasi

source: contains
et: sisaldab

source: doesn't contain
et: ei sisalda

source: starts with
et: algab

source: ends with
et: lõpeb

source: Last.fm Account Login
et: Last.fm konto sisselogimine

source: Please enter your Last.fm account credentials.
et: Palun sisesta oma Last.fm kontotunnused.

source: Save and Log In
et: Salvesta ja logi sisse

source: Authorize for Last.fm
et: Logi Last.fm'i sisse

source: This service does not exist.
et: Seda teenust pole olemas.

source: This station is not available.
et: See jaam pole saadaval.

source: The request is missing a required parameter.
et: Päringul puudub vajalik parameeter.

source: The specified resource is invalid.
et: See ressurss on vigane.

source: Server error, please try again later.
et: Serveri viga, palun proovi hiljem uuesti.

source: Invalid authentication information, please re-authenticate.
et: Vigane autentimise teave, palun taasautendi.

source: The API key used by this application is invalid.
et: API võti, mis on kasutatud selle rakenduse poolt on vigane.

source: The streaming system is offline for maintenance, please try again later.
et: Vooserver pole hooldustööde tõttu saadaval, proovi hiljem uuesti.

source: The method signature is invalid.
et: Meetodi allkiri on vigane.

source: There is not enough content to play this station.
et: Selle jaama esitamiseks pole piisavalt sisu.

source: This group does not have enough members for radio.
et: Sellel grupil pole raadio jaoks piisavalt liikmeid.

source: This artist does not have enough fans for radio.
et: Sellel artistil pole raadio jaoks piisavalt fänne.

source: There are not enough neighbours for this station.
et: Selle jaama jaoks pole piisavalt naabreid.

source: There was an unknown error.
et: Esines tundmatu viga.

source: Not connected to Last.fm.
et: Pole ühendatud serveriga Last.fm.

source: Account details are needed before you can connect to Last.fm
et: Konto üksikasjad tuleb määrata enne Last.fm serveriga ühendumist

source: No network connection detected.
et: Võrguühendust ei tuvastatud.

source: Last.fm username is invalid.
et: Last.fm kasutajanimi on vale.

source: Connecting to Last.fm.
et: Ühendumine serveriga Last.fm.

source: Connected to Last.fm.
et: Ühendatud serveriga Last.fm.

source: Unknown Podcast
et: Tundmatu Podcast

source: Disk Usage Analyzer
et: Kettakasutuse analüsaator

source: Check folder sizes and available disk space
et: Kaustade suuruse ja saadaoleva kettaruumi kontroll
